'''
Author: Yifei Wang
Github: ephiewangyf@gmail.com
Date: 2025-03-25 20:41:31
LastEditors: ephie && ephiewangyf@gmail.com
LastEditTime: 2025-03-25 20:49:17
FilePath: /Agents-Sim/irrationalAgents/agents_modules/personality/cognition.py
Description: 
'''
#Elolving Agents: 会話が発生するたびに、エージェントは現在の対話者と以前に議論した内容の要約を確認する。そして、以前に議論されたトピックに基づいて「さらに」新しいトピックを決定し、この新しいトピックを中心に議論する。この対話のメカニズムが、ひらめきと視点の生成を高める。例えば、イザベラとソフィアの話し合いは、自己啓発や社会的ニーズから、社会的プレッシャーの下で創造性や精神的健康を維持するための具体的な方法へと深まっていき、その手順を図5に示した。このメカニズムは、現実世界のコミュニケーションを反映しており、親しみと議論の深まりによって、特定のトピックについてますます刺激的で詳細な洞察が得られるようになる。抽象的なエージェントの関係： Evolving Agentsでは、エージェントと他者との関係を記述するためにパラメータや特定のカテゴリを使用しません。そうすることで、特定のエージェントとの相互作用が過度に事前決定されてしまうことがわかりました。我々は、エージェントの対話記憶に基づいて、大規模な言語モデルが好ましい会話相手を選択することを可能にする。同時に、エージェントにその選択の理由を提供することを要求する。このアプローチは、より合理的で興味をそそる社会的選択をもたらし、エージェントが会話相手をオープンに選び、ジレンマに対する多様な視点を得ることを可能にする。例えば、外部からの期待と個人的な願望のバランスをとっているイザベラは、図6に示すように、社会的洞察に関心のある文学者のソフィアと個人的な夢や社会的責任などの問題に焦点を当てたり、恋愛映画監督のアイラと個人的な追求と親密な関係のバランスに焦点を当てたりするかもしれない。このプロセスは、エージェントがパーソナリティ進化の過程でより多くの可能性を追求するのに役立つと考えます。

#かし、我々のシステムでは、記憶モジュールを通してフィルタリングされた情報は、膨大な量の断片化されたデータのままであり、エージェントが全体論的思考のためにそれらを統合することを困難にしている。そこで、Cognitionモジュール内にInsightサブモジュールを設計し、この全体的な思考プロセスをシミュレートできるようにした。さらに、Insightが個人の認知プロセスの多様性を反映することを目指しています。そのため、インサイトが完全な性格構造を参照し、1日のすべての出来事と長期記憶を要約し、反映できるようにしています。例えば、1日目、ベンジャミンは、豊かな人間になるためには、技術的なブレークスルーだけでなく、人道的ケアや社会的スキルの向上も必要であることに気づく。2日目、ベンジャミンはテクノロジーと人文科学の融合の可能性を見いだし、技術的な探求に人道的な視点を取り入れ始め、両者の調和したバランスを模索する。その手順を図11.3.2.4に示す。チェーンのような更新プロセス： CharacterGrowthモジュールは、エージェントの人格の更新をシミュレートし、日々の進化をエージェントのCharacter Structureの中で更新される包括的な記述に変換します。この構造には複雑なアルゴリズムロジックは含まれませんが、パーソナリティの変化を正確に描写するためには、迅速なエンジニアリングによる高い精度が要求されます。我々は、Character Structure内の相互関係を考慮し、Character Structureの次元に基づき、基本情報を除く4つの連続的なサブプロセスに分割した後、Character Growthプロセスをチェーンのようなパターンで設計しました： 状態修正」、「特徴修正」、「矛盾修正」、「嗜好修正」。具体的なプロンプトの設計では、キャラクター構造の次元を維持し、エージェントの現在の状態に基づいた新しい性格情報を継続的に要約し、対応する次元に埋めていく。その後の成長を継続的に評価する際、この成長メカニズムにより、パーソナリティの変化について追跡可能で観察可能な記述を得ることができました。
# 例えば、テクノロジーに没頭していた1日目のベンジャミンに比べ、彼の性格には、人生は仕事や学業以上のものを含むという認識が含まれるようになり、健康と幸福の維持に重点を置くようになった。この変化は、図12に示すように、2人の会話の中でゾーイが健康的なライフスタイルを勧めたことが影響しており、ベンジャミンの性格の変容を浮き彫りにしている。同様に、イザベラはソフィアとの交流や広場での孤独な内省によって、順応的な性格から、より自由で真正な性格へと変化していく。

from prompt.llm_command_list import *

def cognition(self):
    self.agent = 0
    self.knowledge_base = {}
    self.decision_history = []
    
    learnings = gpt_analyze_memory(self.basic_info['goals'], self.recent_memories)
    self.growth(learnings)
    return "OK"
    